## Exercícis Sprint 1

In [1]:
import mysql.connector
from credentials import user, password

In [2]:
# Variables per la connexió sql al NoteBook de Jupyter
mydb = mysql.connector.connect(
  host="localhost",
  user=user,
  password=password
)

In [3]:
cursor = mydb.cursor()

In [4]:
# Entrar a la base de dades creada
cursor.execute("USE movies")

In [5]:
# Mostrar les taules de movies
cursor.execute("SHOW TABLES")

for x in cursor:
    print(x)

('tb_genre',)
('tb_movie',)
('tb_movie_person',)
('tb_person',)
('tb_role',)

### Exercici 1

A partir dels documents adjunts (estructura i dades), crea una base de dades amb MySQL. Mostra les característiques principals de l'esquema creat i explica les diferents taules i variables que hi ha.

In [6]:
ls *.png

movies.png

![Logo](movies.png)

A partir dels documents adjunts s'han creat 5 taules:
1. tb_genre on trobem els gèneres existents,
2. tb_movie amb informació de les películes,
3. tb_role on hi ha informació dels rols,
4. tb_person amb informació de les persones que han treballat en les películes i
5. tb_movie_person on hi ha claus foranas relacionades amb les taules anteriors.

A la taula tb_genre hi ha 5 variables i 11 entrades:
* genre_id -> Clau Primària que es relaciona amb la Clau Forana movie_genre_id de la taula tb_movie. Nombre Enter.
* genre_name -> Nom del gènere de la película. Variable Caràcters.
* created_by_user -> Nom de l'usuari que va fer lẽntrada. Variable Caràcters.
* created_date -> Data de creació format YMD (Any, mes, dia).
* updated_date -> Data d'actualització YMD (Any, mes, dia).

A la taula tb_movie hi ha 8 variables i 16 entrades:
* movie_id -> Clau primària que es relaciona amb movie_id de la taula tb_movie_person. Nombre Enter.
* movie_title -> Variable Caràcters.
* movie_date -> Data de la película YMD (Any, mes, dia).
* movie_format -> Format de la película. Variable Caràcters.
* movie_genre_id -> Clau Forana que fa referència a genre_id de la taula tb_genre. Nombre Enter.
* created_by_user -> Nom de l'usuari que va fer lẽntrada. Variable Caràcters.
* created_date -> Data de creació format YMD (Any, mes, dia).
* updated_date -> Data d'actualització YMD (Any, mes, dia).

A la taula tb_role hi ha 5 variables i 5 entrades:
* role_id -> Clau Primària que es relaciona amb la variable role_id de la taula tb_mobie_person. Nombre Enter.
* role_name -> Nom del rol. Variable Caràcters.
* created_by_user -> Nom de l'usuari que va fer lẽntrada. Variable Caràcters.
* created_date -> Data de creació format YMD (Any, mes, dia).
* updated_date -> Data d'actualització YMD (Any, mes, dia).

A la taula tb_person hi ha 9 variables i 42 entrades:
* person_id -> Clau Primària que es relaciona amb la variable person_id de la taula tb_mobie_person. Nombre Enter.
* person_name -> Nom de la persona. Variable Caràcters.
* person_country -> Nacionalitat de la persona. Variable Caràcters.
* person_dob -> Data de Naixement YMD (Any, mes, dia).
* person_dod -> Data de Defunció YMD (Any, mes, dia).
* person_parent_id -> Clau Forana. Relacionada amb person_id de la mateixa taula. Nom del pare si aquest també està a la llista.
* created_by_user -> Nom de l'usuari que va fer lẽntrada. Variable Caràcters.
* created_date -> Data de creació format YMD (Any, mes, dia).
* updated_date -> Data d'actualització YMD (Any, mes, dia).

A la taula tb_person hi ha 7 variables i 42 entrades:
* movie_id -> Clau primària que es relaciona amb movie_id de la taula tb_movie. Nombre Enter.
* person_id -> Clau Primària que es relaciona amb la variable person_id de la taula tb_person. Nombre Enter.
* genre_id -> Clau Primària que es relaciona amb la variable genre_id de la taula tb_genre. Nombre Enter.
* movie_award_ind -> Variable Caràcter (1). Accepta Y (sí) y N (No) per denotar si la pelícila ha estat indicada per algun premi.
* created_by_user -> Nom de l'usuari que va fer lẽntrada. Variable Caràcters.
* created_date -> Data de creació format YMD (Any, mes, dia).
* updated_date -> Data d'actualització YMD (Any, mes, dia).

Les relacions entre les taules són denotades pel les líneas sòlides (relació ONE to ONE) i discontinues (ONE to MANY).

### Exercici 2
Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data de mort i ordenar les dades de la persona més vella a la persona més jove.

**mysql code:**

SELECT person_name, person_country, person_dob

FROM tb_person

WHERE person_dod IS NULL

ORDER BY person_dob;

In [7]:
cursor.execute("SELECT person_name, person_country, person_dob \
                FROM tb_person\
                WHERE person_dod IS NULL\
                ORDER BY person_dob")

for x in cursor:
    print(x)

('John Williams', 'United States', datetime.date(1928, 8, 8))
('Vera Miles', 'United States', datetime.date(1929, 8, 23))
('Sean Connery', 'Scotland', datetime.date(1930, 7, 8))
('Robert Duvall', 'United States', datetime.date(1931, 1, 5))
('Morgan Freeman', 'United States', datetime.date(1935, 10, 1))
('Francis Ford Coppola', 'United States', datetime.date(1939, 4, 7))
('Gary Kurtz', 'United States', datetime.date(1940, 7, 27))
('Martin Sheen', 'United States', datetime.date(1940, 8, 3))
('Harrison Ford', 'United States', datetime.date(1942, 7, 13))
('George Lucas', 'United States', datetime.date(1944, 5, 14))
('Carmine Coppola', 'United States', datetime.date(1945, 7, 8))
('Steven Spielberg', 'United States', datetime.date(1946, 12, 18))
('Tim Robbins', 'United States', datetime.date(1949, 6, 7))
('Mel Gibson', 'Australia', datetime.date(1950, 8, 9))
('Tom Hanks', 'United States', datetime.date(1956, 7, 9))
('Emilio Martinez Lazaro', 'Spain', datetime.date(1956, 9, 9))
('Karra Elejalde', 'Spain', datetime.date(1960, 3, 6))
('Emilio Estevez', 'United States', datetime.date(1962, 5, 12))
('Ramón Estevez', 'United States', datetime.date(1963, 8, 7))
('Carmen Machi', 'Spain', datetime.date(1964, 8, 9))
('Charlie Sheen', 'United States', datetime.date(1965, 9, 3))
('Reneé Estevez', 'United States', datetime.date(1967, 4, 2))
('Catherine Zeta-Jones', 'Wales', datetime.date(1969, 9, 25))
('Robert Alamo', 'Spain', datetime.date(1970, 5, 6))
('Daniel Sanchez Arevalo', 'Spain', datetime.date(1970, 6, 8))
('Quim Gutierrez', 'Spain', datetime.date(1981, 3, 27))
('Veronica Echegui', 'Spain', datetime.date(1983, 3, 14))
('Taylor Levi Estevez', 'United States', datetime.date(1984, 6, 22))
('Dani Rovira', 'Spain', datetime.date(1984, 7, 1))
('Paula Speert Sheen', 'United States', datetime.date(1986, 1, 6))
('Paloma Rae Estevez', 'United States', datetime.date(1986, 2, 15))
('Clara Lago', 'Spain', datetime.date(1986, 4, 17))
('Patrick Criado', 'Spain', datetime.date(1995, 9, 23))
('Paula Jones-Sheen', 'United States', datetime.date(2003, 7, 6))
('Sam Sheen', 'United States', datetime.date(2004, 3, 9))
('Lola Sheen', 'United States', datetime.date(2005, 6, 1))
('Bob Sheen', 'United States', datetime.date(2009, 5, 1))
('Max Sheen', 'United States', datetime.date(2009, 5, 1))

### Exercici 3

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i ordenar-ho per ordre descendent de nombre total de pel·lícules.

**mysql code:**


SELECT  tb_genre.genre_name, COUNT(tb_movie.movie_genre_id) FROM tb_movie

INNER JOIN tb_genre ON  tb_movie.movie_genre_id=tb_genre.genre_id

GROUP BY tb_genre.genre_name

ORDER BY COUNT(tb_movie.movie_genre_id) DESC;

In [8]:
cursor.execute("SELECT  tb_genre.genre_name, COUNT(tb_movie.movie_genre_id) FROM tb_movie\
                INNER JOIN tb_genre ON  tb_movie.movie_genre_id=tb_genre.genre_id\
                GROUP BY tb_genre.genre_name\
                ORDER BY COUNT(tb_movie.movie_genre_id) DESC")

for x in cursor:
    print(x)

('Comedia', 3)
('Acción', 2)
('Ciencia Ficción', 2)
('Drama', 2)
('Suspense', 2)
('Fantasía', 1)
('Romance', 1)
('Terror', 1)
('Bélico', 1)

### Exercici 4

##### Realitza la següent consulta sobre la base de dades acabada de crear: 

1. Has d'obtenir, per a cada persona, el seu nom i el nombre màxim de rols diferents que ha tingut en una mateixa pel·lícula. 

2. Posteriorment, mostra únicament aquelles persones que hagin assumit més d'un rol en una mateixa pel·lícula.

4.1.
**mysql code**

SELECT tb_person.person_name, COUNT(tb_movie_person.role_id), tb_movie_person.movie_id

FROM tb_person

INNER JOIN tb_movie_person ON tb_person.person_id = tb_movie_person.person_id 

GROUP BY tb_person.person_name, tb_movie_person.movie_id 

ORDER BY COUNT(tb_movie_person.role_id) DESC;

In [9]:
cursor.execute("SELECT tb_person.person_name, COUNT(tb_movie_person.role_id), tb_movie_person.movie_id \
                FROM tb_person\
                INNER JOIN tb_movie_person ON tb_person.person_id = tb_movie_person.person_id\
                GROUP BY tb_person.person_name, tb_movie_person.movie_id \
                ORDER BY COUNT(tb_movie_person.role_id) DESC")

for x in cursor:
    print(x)

('Francis Ford Coppola', 3, 1)
('Alfred Joseph Hitchcock', 3, 7)
('Mel Gibson', 2, 13)
('George Lucas', 2, 3)
('Steven Spielberg', 2, 4)
('Vera Miles', 1, 7)
('Charlie Sheen', 1, 1)
('Emilio Martinez Lazaro', 1, 8)
('Emilio Martinez Lazaro', 1, 9)
('Emilio Martinez Lazaro', 1, 10)
('Dani Rovira', 1, 8)
('Dani Rovira', 1, 9)
('Clara Lago', 1, 8)
('Clara Lago', 1, 9)
('Carmen Machi', 1, 8)
('Carmen Machi', 1, 9)
('Karra Elejalde', 1, 8)
('Karra Elejalde', 1, 9)
('Morgan Freeman', 1, 14)
('Tim Robbins', 1, 14)
('Anthony Perkins', 1, 7)
('Catherine Zeta-Jones', 1, 4)
('Tom Hanks', 1, 4)
('John Williams', 1, 3)
('Steven Spielberg', 1, 6)
('Steven Spielberg', 1, 5)
('Steven Spielberg', 1, 3)
('Gary Kurtz', 1, 2)
('George Lucas', 1, 2)
('Harrison Ford', 1, 3)
('Harrison Ford', 1, 2)
('Harrison Ford', 1, 1)
('Martin Sheen', 1, 1)
('Robert Duvall', 1, 1)
('Marlon Brando', 1, 1)
('Carmine Coppola', 1, 1)

### DUBTE

En l'exercici 4.1 no aconsegueixo el resultat demanat ja que hi ha noms de persona que apareixen més d'una vegada degut a que han treballat en diferents películes. He probat de fer servir l'argument MAX en la columna on es conten el número de rols COUNTS(tb_movie_person.role_id) sense success. Com hauria de resoldre-ho en sql?


Alternativament, en les seguent lineas de codi creo una conexió i llegeixo la sortida amb la llibreria Pandas on elimino els duplicats amb el número més baix de rols aconseguint el resultat esperat:

In [10]:
# importació de paquets
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [11]:
# connexió amb sql
db_connection_str = 'mysql+pymysql://{user}:{password}@localhost/movies'.format(user=user, password=password)
db_connection = create_engine(db_connection_str)

In [12]:
# Aquest primer df és el mateix obtingut anteriorment
df = pd.read_sql('SELECT tb_person.person_name, COUNT(tb_movie_person.role_id), tb_movie_person.movie_id \
                FROM tb_person\
                INNER JOIN tb_movie_person ON tb_person.person_id = tb_movie_person.person_id\
                GROUP BY tb_person.person_name, tb_movie_person.movie_id \
                ORDER BY COUNT(tb_movie_person.role_id) DESC', con=db_connection)

In [13]:
# Aqui es mostra el resultat correcte.
df_no_duplicates = df.drop_duplicates(subset='person_name', keep='first')
df_no_duplicates

                person_name  COUNT(tb_movie_person.role_id)  movie_id
0      Francis Ford Coppola                               3         1
1   Alfred Joseph Hitchcock                               3         7
2                Mel Gibson                               2        13
3              George Lucas                               2         3
4          Steven Spielberg                               2         4
5                Vera Miles                               1         7
6             Charlie Sheen                               1         1
7    Emilio Martinez Lazaro                               1         8
10              Dani Rovira                               1         8
12               Clara Lago                               1         8
14             Carmen Machi                               1         8
16           Karra Elejalde                               1         8
18           Morgan Freeman                               1        14
19              Tim Robbins                               1        14
20          Anthony Perkins                               1         7
21     Catherine Zeta-Jones                               1         4
22                Tom Hanks                               1         4
23            John Williams                               1         3
27               Gary Kurtz                               1         2
29            Harrison Ford                               1         3
32             Martin Sheen                               1         1
33            Robert Duvall                               1         1
34            Marlon Brando                               1         1
35          Carmine Coppola                               1         1

4.2.**mysql code**

SELECT tb_person.person_name, COUNT(tb_movie_person.role_id), tb_movie_person.movie_id

FROM tb_person

INNER JOIN tb_movie_person ON tb_person.person_id = tb_movie_person.person_id

GROUP BY tb_person.person_name, tb_movie_person.movie_id

HAVING COUNT(tb_movie_person.role_id) > 1;

In [14]:
cursor.execute("SELECT tb_person.person_name, COUNT(tb_movie_person.role_id), tb_movie_person.movie_id \
                FROM tb_person\
                INNER JOIN tb_movie_person ON tb_person.person_id = tb_movie_person.person_id\
                GROUP BY tb_person.person_name, tb_movie_person.movie_id \
                HAVING COUNT(tb_movie_person.role_id) > 1")

for x in cursor:
    print(x)

('Francis Ford Coppola', 3, 1)
('George Lucas', 2, 3)
('Steven Spielberg', 2, 4)
('Alfred Joseph Hitchcock', 3, 7)
('Mel Gibson', 2, 13)

### Exercici 5

##### Realitza la següent operació sobre la base de dades acabada de crear: 

##### Has de crear un nou gènere anomenat "Documental" el qual tingui com a identificador el nombre 69.

**mysql terminal code**

INSERT INTO tb_genre (genre_id, genre_name, created_by_user, created_date)

VALUES (69, "Documental","Jordi","2023-04-02")

En aquest cas no escric el codi en el notebook de Python ja que, com que les dades ja han estat inserides em donaria un missatge d'error.

In [15]:
cursor.execute("SELECT * FROM tb_genre")

for x in cursor:
    print(x)

(1, 'Acción', 'OS_SGAD', None, None)
(2, 'Ciencia Ficción', 'OS_SGAD', None, None)
(3, 'Comedia', 'OS_SGAD', None, None)
(4, 'Drama', 'OS_SGAD', None, None)
(5, 'Fantasía', 'apermag', None, None)
(6, 'Melodrama', 'apermag', datetime.date(2018, 9, 1), datetime.date(2018, 9, 27))
(7, 'Musical', 'OS_SGAD', None, None)
(8, 'Romance', 'OS_SGAD', None, None)
(9, 'Suspense', 'OS_SGAD', None, None)
(10, 'Terror', 'OS_SGAD', None, None)
(11, 'Bélico', 'OS_SGAD', None, None)
(69, 'Documental', 'Jordi', datetime.date(2023, 4, 2), None)

### Exercici 6

Fes la següent operació sobre la base de dades acabada de crear:  

Elimina la pel·lícula "La Gran Familia Española" de la base de dades.

**mysql terminal code**

DELETE FROM tb_movie_person WHERE movie_id  = 11;

DELETE FROM tb_movie WHERE movie_title  = "La Gran Familia Española";

In [16]:
# La Gran Familia Española ja no és a la base de dades OLD movie_id = 11
cursor.execute("SELECT * FROM tb_movie")

for x in cursor:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 3, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)

### Exercici 7

Realitza la següent operació sobre la base de dades acabada de crear: 

Canvia el gènere de la pel·lícula "Ocho apellidos catalanes" perquè consti com a comèdia i no com a romàntica.

**mysql code**

UPDATE tb_movie

SET movie_genre_id = 3

WHERE movie_title = "Ocho Apellidos Catalanes";

In [17]:
# Ocho apellidos Catalanes (movie_id = 9) és ara una comèdia
cursor.execute("SELECT * FROM tb_movie")

for x in cursor:
    print(x)

(1, 'Apocalypse Now', datetime.date(1979, 5, 10), 'Film', 11, 'OS_SGAD', None, None)
(2, 'Star Wars:Episode IV - A New Hope', datetime.date(1977, 5, 25), 'Film', 2, 'OS_SGAD', None, None)
(3, 'Indiana Jones and the Temple of Doom', datetime.date(1984, 5, 8), 'Film', 1, 'OS_SGAD', None, None)
(4, 'The Terminal', datetime.date(2004, 6, 18), 'Digital', 3, 'OS_SGAD', None, None)
(5, 'Jaws', datetime.date(1975, 1, 1), 'Film', 10, 'OS_SGAD', None, None)
(6, 'ET The Extraterrestrial', datetime.date(1982, 7, 25), 'Film', 5, 'OS_SGAD', None, None)
(7, 'Psycho', datetime.date(1960, 5, 6), 'Film', 9, 'OS_SGAD', None, None)
(8, 'Ocho Apellidos Vascos', datetime.date(2014, 3, 14), 'Digital', 3, 'OS_SGAD', None, None)
(9, 'Ocho Apellidos Catalanes', datetime.date(2016, 6, 9), 'Digital', 3, 'OS_SGAD', None, None)
(10, 'El otro lado de la cama', datetime.date(2002, 9, 4), 'Digital', 8, 'OS_SGAD', None, None)
(12, 'El dia de la bestia', datetime.date(1994, 12, 25), 'Film', 1, 'OS_SGAD', None, None)
(13, 'Braveheart', datetime.date(1995, 8, 8), 'Film', 4, 'OS_SGAD', None, None)
(14, 'The Shawshank Redemption', datetime.date(1992, 1, 7), 'Film', 4, 'OS_SGAD', None, None)
(15, 'Las brujas de Zugarramurdi', datetime.date(2009, 10, 7), 'Digital', 9, 'OS_SGAD', None, None)
(16, 'Blade Runner', datetime.date(1982, 12, 25), 'Digital', 2, 'OS_SGAD', None, None)